### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# Files to Load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

In [2]:
#View first five himes of school data
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [3]:
#View first five himes of student data
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [4]:
# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [5]:
#View all columns in merged dataframe
school_data_complete.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [6]:
#Determine data types
school_data_complete.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [66]:
#Check for duplicate names
student_data[student_data.duplicated('student_name')].sort_values(['student_name'])

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
18279,18279,Aaron Evans,M,12th,Bailey High School,93,76
18153,18153,Aaron Gonzalez,M,11th,Bailey High School,81,60
38299,38299,Aaron Holmes,M,10th,Thomas High School,76,72
28906,28906,Aaron Johnson,M,9th,Rodriguez High School,94,62
13875,13875,Aaron Johnson,M,9th,Wilson High School,84,90
...,...,...,...,...,...,...,...
36232,36232,Zachary Smith,M,12th,Ford High School,79,59
9029,9029,Zachary Torres,M,10th,Hernandez High School,73,88
17889,17889,Zachary Williams,M,12th,Bailey High School,77,89
20464,20464,Zachary Williams,M,9th,Bailey High School,97,55
23034,23034,Zoe Hawkins,F,11th,Holden High School,97,75

In [ ]:
#Check for duplicate names
student_data.groupby(['student_name']).size()

In [7]:
#Check for null values
school_data_complete.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
School ID        0
type             0
size             0
budget           0
dtype: int64

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [8]:
#Calculate the total number of schools
schoolCount = school_data['school_name'].nunique()
schoolCount

15

In [9]:
#Calculate the total number of students
studentCount = student_data['Student ID'].nunique()
studentCount

39170

In [10]:
#Calculate the total budget
districtBudget = school_data["budget"].sum()

In [11]:
#Calculate the average math score
avgMathScore = student_data['math_score'].mean()
avgMathScore

78.98537145774827

In [12]:
#Calculate the average reading score
avgReadScore = student_data['reading_score'].mean()
avgReadScore

81.87784018381414

In [13]:
#Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2
overallScore = (avgMathScore + avgReadScore)/2
overallScore

80.43160582078121

In [14]:
#Calculate the percentage of students with a passing math score (70 or greater)
passedMathCount = len(student_data[student_data['math_score'] >= 70])
perPassedMath = (passedMathCount/studentCount) * 100
perPassedMath

74.9808526933878

In [15]:
#Calculate the percentage of students with a passing reading score (70 or greater)
passedReadCount = len(student_data[student_data['reading_score'] >= 70])
perPassedRead = (passedReadCount/studentCount) * 100
perPassedRead

85.80546336482001

In [16]:
#Create a dataframe to hold the above results
districtSummDict = [{'Total Schools': schoolCount,
                    'Total Students': studentCount,
                    'Total Budget': districtBudget,
                    'Average Math Score': avgMathScore,
                    'Average Reading Score': avgReadScore,
                    '% Passing Math': perPassedMath,
                    '% Passing Reading': perPassedRead,
                    '% Overall Passing Rate': overallScore}]
districtSumm = pd.DataFrame(districtSummDict)
districtSumm.head()

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,80.431606

In [17]:
#Optional: give the displayed data cleaner formatting
districtSumm['Total Schools'] = districtSumm['Total Schools'].map("{:,}".format)
districtSumm['Total Students'] = districtSumm['Total Students'].map("{:,}".format)  
districtSumm['Total Budget'] = districtSumm['Total Budget'].map("${:,}".format)
districtSumm['Average Math Score'] = districtSumm['Average Math Score'].map("{:.2f}".format)
districtSumm['Average Reading Score'] = districtSumm['Average Reading Score'].map("{:.2f}".format)
districtSumm['% Passing Math'] = districtSumm['% Passing Math'].map("{:.2f}%".format)
districtSumm['% Passing Reading'] = districtSumm['% Passing Reading'].map("{:.2f}%".format)
districtSumm['% Overall Passing Rate'] = districtSumm['% Overall Passing Rate'].map("{:.2f}%".format)
districtSumm.head()

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,"39,170","$24,649,428",78.99,81.88,74.98%,85.81%,80.43%

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)
  
* Create a dataframe to hold the above results

In [38]:
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [19]:
#School Name
#indexedSchool = school_data_complete.set_index('school_name', inplace = True)
#indexedSchool

In [20]:
#Create 'School Type' column
schoolType = school_data.set_index(["school_name"])["type"]
schoolType

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [34]:
#Create 'Total Students' column
schoolSize = school_data.set_index(["school_name"])["size"]
schoolSize

school_name
Huang High School        2917
Figueroa High School     2949
Shelton High School      1761
Hernandez High School    4635
Griffin High School      1468
Wilson High School       2283
Cabrera High School      1858
Bailey High School       4976
Holden High School        427
Pena High School          962
Wright High School       1800
Rodriguez High School    3999
Johnson High School      4761
Ford High School         2739
Thomas High School       1635
Name: size, dtype: int64

In [35]:
#Total School Budget
schoolBudget = school_data.set_index(["school_name"])["budget"]
schoolBudget

school_name
Huang High School        1910635
Figueroa High School     1884411
Shelton High School      1056600
Hernandez High School    3022020
Griffin High School       917500
Wilson High School       1319574
Cabrera High School      1081356
Bailey High School       3124928
Holden High School        248087
Pena High School          585858
Wright High School       1049400
Rodriguez High School    2547363
Johnson High School      3094650
Ford High School         1763916
Thomas High School       1043130
Name: budget, dtype: int64

In [40]:
#Create 'Per Student Budget' column
budgetPerStudent = schoolBudget/schoolSize
budgetPerStudent

school_name
Huang High School        655.0
Figueroa High School     639.0
Shelton High School      600.0
Hernandez High School    652.0
Griffin High School      625.0
Wilson High School       578.0
Cabrera High School      582.0
Bailey High School       628.0
Holden High School       581.0
Pena High School         609.0
Wright High School       583.0
Rodriguez High School    637.0
Johnson High School      650.0
Ford High School         644.0
Thomas High School       638.0
dtype: float64

In [47]:
#Create 'Average Math Score' column
avgSchoolMathScore = school_data_complete.groupby(['school_name']).mean()['math_score']
avgSchoolMathScore

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [48]:
#Create 'Average Reading Score' column
avgSchoolReadScore = school_data_complete.groupby(['school_name']).mean()['reading_score']
avgSchoolReadScore

school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [50]:
#Filter out only the student that passed math
passMathStudent = school_data_complete[school_data_complete['math_score']>=70]

#Group the above dataframe by School and count students

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [27]:
#% Passing Reading

In [28]:
#Overall Passing Rate (Average of the above two)

In [29]:
#Create a dataframe to hold the above results

## Top Performing Schools (By Passing Rate)

* Sort and display the top five schools in overall passing rate

In [30]:
# Reorganizing the columns using double brackets
#organized_df = training_data[["Name","Trainer","Weight","Membership(Days)"]]
#organized_df.head()

In [31]:
#Using .rename(columns={}) in order to rename columns
#renamed_df = organized_df.rename(columns={"Membership(Days)":"Membership in Days", "Weight":"Weight in Pounds"})

## Bottom Performing Schools (By Passing Rate)

* Sort and display the five worst-performing schools

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

## Reading Score by Grade

* Perform the same operations as above for reading scores

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [32]:
# Sample bins. Feel free to create your own bins.
spending_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

## Scores by School Size

* Perform the same operations as above, based on school size.

In [33]:
# Sample bins. Feel free to create your own bins.
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

## Scores by School Type

* Perform the same operations as above, based on school type.